#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
module.function_apps.module.function_app_support_autoscaler.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.function_apps.module.function_app_user_autoscaler_02.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.function_apps.module.function_app_user_autoscaler_02.data.azurerm_linux_function_app.this[0]: Still reading... [20s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.apim.azurerm_api_management_api_operation_policy.get_current_wallet_instance_status_policy will be updated in-place
  ~ resource "azurerm_api_management_api_operation_policy" "get_current_wallet_instance_status_policy" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.ApiManagement/service/io-p-apim-v2-api/apis/io-p-ioweb-wallet/operations/getCurrentWalletInstanceStatus"
      ~ xml_content         = <<-EOT
          - <policies>
          - 	<inbound>
          - 		<base />
          - 		<!-- forwards the call to the Function App -->
          - 		<set-header name="Authorization" exists-action="delete" />
          - 		<set-method>POST</set-method>
          - 		<set-header name="Content-Type" exists-action="override">
          - 			<value>application/json</value>
          - 		</set-header>
          - 		<set-body>@{
          -             var fiscalCode = context.Variables["fiscalCode"];
          -             return $"{{ \"fiscal_code\": \"{fiscalCode}\" }}";
          -         }</set-body>
          - 		<set-header name="x-functions-key" exists-action="override">
          - 			<value>{{io-wallet-user-func-key}}</value>
          - 		</set-header>
          - 	</inbound>
          - 	<outbound>
          - 		<base />
          - 	</outbound>
          - 	<backend>
          - 		<base />
          - 	</backend>
          - 	<on-error>
          - 		<base />
          - 	</on-error>
          + <policies>
          +     <inbound>
          +         <base />
          +         <!-- forwards the call to the Function App -->
          +         <set-header name="Authorization" exists-action="delete" />
          +         <set-method>GET</set-method>
          +         <set-header name="fiscal-code" exists-action="override">
          +             <value>@((string)context.Variables["fiscalCode"])</value>
          +         </set-header>
          +         <set-header name="x-functions-key" exists-action="override">
          +             <value>{{io-wallet-user-func-key}}</value>
          +         </set-header>
          +     </inbound>
          +     <outbound>
          +         <base />
          +     </outbound>
          +     <backend>
          +         <base />
          +     </backend>
          +     <on-error>
          +         <base />
          +     </on-error>
            </policies>
        EOT
        # (4 unchanged attributes hidden)
    }

  # module.apim.azurerm_api_management_named_value.trial_system_feature_flag will be created
  + resource "azurerm_api_management_named_value" "trial_system_feature_flag" {
      + api_management_name = "io-p-apim-v2-api"
      + display_name        = "trial-system-feature-flag"
      + id                  = (known after apply)
      + name                = "trial-system-feature-flag"
      + resource_group_name = "io-p-rg-internal"
      + secret              = false
      + value               = (sensitive value)
    }

  # module.cosmos.azurerm_cosmosdb_account.wallet will be updated in-place
  ~ resource "azurerm_cosmosdb_account" "wallet" {
        id                                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.DocumentDB/databaseAccounts/io-p-itn-wallet-cosno-01"
        name                                     = "io-p-itn-wallet-cosno-01"
        tags                                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (33 unchanged attributes hidden)

      - geo_location {
          - failover_priority = 1 -> null
          - id                = "io-p-itn-wallet-cosno-01-spaincentral" -> null
          - location          = "spaincentral" -> null
          - zone_redundant    = false -> null
        }
      + geo_location {
          + failover_priority = 1
          + id                = (known after apply)
          + location          = "germanywestcentral"
          + zone_redundant    = false
        }

        # (4 unchanged blocks hidden)
    }

  # module.function_apps.azurerm_key_vault_secret.app_insights_connection_string will be created
  + resource "azurerm_key_vault_secret" "app_insights_connection_string" {
      + content_type            = "token"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-wallet-kv-01"
      + name                    = "AppInsightsConnectionString"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.apim.module.apim_v2_web_wallet_api.azurerm_api_management_api_policy.this[0] will be updated in-place
  ~ resource "azurerm_api_management_api_policy" "this" {
        id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.ApiManagement/service/io-p-apim-v2-api/apis/io-p-ioweb-wallet"
      ~ xml_content         = <<-EOT
          - <!-- TODO SIW-1820 -->
          - <policies>
          - 	<inbound>
          - 		<base />
          - 		<cors>
          - 			<allowed-origins>
          - 				<origin>https://ioapp.it/</origin>
          - 			</allowed-origins>
          - 			<allowed-methods preflight-result-max-age="300">
          - 				<method>OPTIONS</method>
          - 				<method>GET</method>
          - 				<method>PUT</method>
          - 			</allowed-methods>
          - 			<allowed-headers>
          - 				<header>Content-Type</header>
          - 				<header>Authorization</header>
          - 			</allowed-headers>
          - 		</cors>
          - 		<!-- validate the jwt using the specified OpenID configuration URLs. Both URLs are used to ensure token validation across different identity providers -->
          - 		<validate-jwt header-name="Authorization" require-scheme="Bearer" output-token-variable-name="jwt">
          - 			<openid-config url="https://wallet.io.pagopa.it/hub-spid-login/openid-configuration" />
          - 			<openid-config url="https://wallet.io.pagopa.it/exchange/openid-configuration" />
          - 			<required-claims>
          - 				<claim name="fiscal_number" />
          - 			</required-claims>
          - 		</validate-jwt>
          - 		<!-- get the claim fiscal_number -->
          - 		<set-variable name="fiscalCode" value="@((string)((Jwt)context.Variables["jwt"]).Claims.GetValueOrDefault("fiscal_number"))" />
          - 		<!-- send the request to trial system -->
          - 		<send-request mode="new" response-variable-name="trialSystemResponse" timeout="5">
          - 			<set-url>@($"https://api.trial.pagopa.it/manage/api/v1/trials/{{trial-id}}/subscriptions/{context.Variables["fiscalCode"]}")</set-url>
          - 			<set-method>GET</set-method>
          - 			<set-header name="Ocp-Apim-Subscription-Key" exists-action="override">
          - 				<value>{{trial-system-api-key}}</value>
          - 			</set-header>
          - 		</send-request>
          - 		<set-variable name="isActive" value="@{
          -             var state = (string)((IResponse)context.Variables["trialSystemResponse"]).Body.As<JObject>()["state"];
          -             return state == "ACTIVE";
          -         } " />
          - 		<choose>
          - 			<when condition="@(context.Variables.GetValueOrDefault<bool>("isActive") != true)">
          - 				<return-response>
          - 					<set-status code="403" reason="Forbidden" />
          - 					<set-body template="liquid">{ "detail": "Access to this resource is forbidden", "status": 403, "title": "Forbidden" } </set-body>
          - 				</return-response>
          - 			</when>
          - 			<otherwise />
          - 		</choose>
          - 	</inbound>
          - 	<outbound>
          - 		<base />
          - 	</outbound>
          + <policies>
          +     <inbound>
          +         <base />
          +         <cors>
          +             <allowed-origins>
          +                 <origin>https://ioapp.it/</origin>
          +             </allowed-origins>
          +             <allowed-methods preflight-result-max-age="300">
          +                 <method>OPTIONS</method>
          +                 <method>GET</method>
          +                 <method>PUT</method>
          +             </allowed-methods>
          +             <allowed-headers>
          +                 <header>Content-Type</header>
          +                 <header>Authorization</header>
          +             </allowed-headers>
          +         </cors>
          +         <!-- validate the jwt using the specified OpenID configuration URLs. Both URLs are used to ensure token validation across different identity providers -->
          +         <validate-jwt header-name="Authorization" require-scheme="Bearer" output-token-variable-name="jwt">
          +             <openid-config url="https://wallet.io.pagopa.it/hub-spid-login/openid-configuration" />
          +             <openid-config url="https://wallet.io.pagopa.it/exchange/openid-configuration" />
          +             <required-claims>
          +                 <claim name="fiscal_number" />
          +             </required-claims>
          +         </validate-jwt>
          +         <!-- get the claim fiscal_number -->
          +         <set-variable name="fiscalCode" value="@((string)((Jwt)context.Variables["jwt"]).Claims.GetValueOrDefault("fiscal_number"))" />
          +         <!-- send the request to trial system -->
          +         <choose>
          +             <when condition="{{trial-system-feature-flag}}">
          +                 <send-request mode="new" response-variable-name="trialSystemResponse" timeout="5">
          +                     <set-url>@($"https://api.trial.pagopa.it/manage/api/v1/trials/{{trial-id}}/subscriptions/{context.Variables["fiscalCode"]}")</set-url>
          +                     <set-method>GET</set-method>
          +                     <set-header name="Ocp-Apim-Subscription-Key" exists-action="override">
          +                         <value>{{trial-system-api-key}}</value>
          +                     </set-header>
          +                 </send-request>
          +                 <choose>
          +                     <when condition="@(((IResponse)context.Variables["trialSystemResponse"]).StatusCode == 200)">
          +                         <set-variable name="isActive" value="@{
          +                         var state = (string)((IResponse)context.Variables["trialSystemResponse"]).Body.As<JObject>()["state"];
          +                         return state == "ACTIVE";
          +                     }" />
          +                         <choose>
          +                             <when condition="@(context.Variables.GetValueOrDefault<bool>("isActive") != true)">
          +                                 <return-response>
          +                                     <set-status code="403" reason="Forbidden" />
          +                                     <set-body template="liquid">{ "detail": "Access to this resource is forbidden", "status": 403, "title": "Forbidden" }</set-body>
          +                                 </return-response>
          +                             </when>
          +                             <otherwise />
          +                         </choose>
          +                     </when>
          +                     <otherwise>
          +                         <return-response>
          +                             <set-status code="403" reason="Forbidden" />
          +                             <set-body template="liquid">{ "detail": "Access to this resource is forbidden", "status": 403, "title": "Forbidden" }</set-body>
          +                         </return-response>
          +                     </otherwise>
          +                 </choose>
          +             </when>
          +         </choose>
          +     </inbound>
          +     <outbound>
          +         <base />
          +     </outbound>
            </policies>
        EOT
        # (3 unchanged attributes hidden)
    }

  # module.function_apps.module.function_app_support.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          # Warning: this attribute value will no longer be marked as sensitive
          # after applying this change.
          ~ "AppInsightsConnectionString"                     = (sensitive value)
            # (21 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Web/sites/io-p-itn-wallet-supp-func-01"
        name                                           = "io-p-itn-wallet-supp-func-01"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Wallet"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (26 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.function_apps.module.function_app_support.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          # Warning: this attribute value will no longer be marked as sensitive
          # after applying this change.
          ~ "AppInsightsConnectionString"                     = (sensitive value)
            # (22 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Web/sites/io-p-itn-wallet-supp-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Wallet"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (22 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_apps.module.function_app_user_02.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          # Warning: this attribute value will no longer be marked as sensitive
          # after applying this change.
          ~ "AppInsightsConnectionString"                     = (sensitive value)
            # (50 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Web/sites/io-p-itn-wallet-user-func-02"
        name                                           = "io-p-itn-wallet-user-func-02"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Wallet"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (26 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.function_apps.module.function_app_user_02.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          # Warning: this attribute value will no longer be marked as sensitive
          # after applying this change.
          ~ "AppInsightsConnectionString"                     = (sensitive value)
            # (51 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Web/sites/io-p-itn-wallet-user-func-02/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (22 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.iam.module.admins_roles["0f0aa158-b7ad-4cac-af02-82c3e4768ee6"].module.storage_account.azurerm_role_assignment.queue["iopitnwalletst01|*|owner"] will be destroyed
  # (because key ["iopitnwalletst01|*|owner"] is not in for_each map)
  - resource "azurerm_role_assignment" "queue" {
      - id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01/providers/Microsoft.Authorization/roleAssignments/1b49bd6d-05d1-d8bb-8269-e7869dcd5578" -> null
      - name                 = "1b49bd6d-05d1-d8bb-8269-e7869dcd5578" -> null
      - principal_id         = "0f0aa158-b7ad-4cac-af02-82c3e4768ee6" -> null
      - principal_type       = "Group" -> null
      - role_definition_id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/974c5e8b-45b9-4653-ba55-5f855dd0fb88" -> null
      - role_definition_name = "Storage Queue Data Contributor" -> null
      - scope                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01" -> null
    }

  # module.iam.module.admins_roles["0f0aa158-b7ad-4cac-af02-82c3e4768ee6"].module.storage_account.azurerm_role_assignment.queue["iopitnwalletst01|*|owner|Storage Queue Data Contributor"] will be created
  + resource "azurerm_role_assignment" "queue" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f0aa158-b7ad-4cac-af02-82c3e4768ee6"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.iam.module.admins_roles["0f0aa158-b7ad-4cac-af02-82c3e4768ee6"].module.storage_account.azurerm_role_assignment.queue["iopitnwalletst01|*|reader"] will be destroyed
  # (because key ["iopitnwalletst01|*|reader"] is not in for_each map)
  - resource "azurerm_role_assignment" "queue" {
      - id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01/providers/Microsoft.Authorization/roleAssignments/1a31545c-1d95-8b9c-5a51-7955a9147a87" -> null
      - name                 = "1a31545c-1d95-8b9c-5a51-7955a9147a87" -> null
      - principal_id         = "0f0aa158-b7ad-4cac-af02-82c3e4768ee6" -> null
      - principal_type       = "Group" -> null
      - role_definition_id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/8a0f0c08-91a1-4084-bc3d-661d67233fed" -> null
      - role_definition_name = "Storage Queue Data Message Processor" -> null
      - scope                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01" -> null
    }

  # module.iam.module.admins_roles["0f0aa158-b7ad-4cac-af02-82c3e4768ee6"].module.storage_account.azurerm_role_assignment.queue["iopitnwalletst01|*|reader|Storage Queue Data Message Processor"] will be created
  + resource "azurerm_role_assignment" "queue" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f0aa158-b7ad-4cac-af02-82c3e4768ee6"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Message Processor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  + resource "azurerm_role_assignment" "queue" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f0aa158-b7ad-4cac-af02-82c3e4768ee6"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.iam.module.admins_roles["0f0aa158-b7ad-4cac-af02-82c3e4768ee6"].module.storage_account.azurerm_role_assignment.queue["iopitnwalletst01|*|writer"] will be destroyed
  # (because key ["iopitnwalletst01|*|writer"] is not in for_each map)
  - resource "azurerm_role_assignment" "queue" {
      - id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01/providers/Microsoft.Authorization/roleAssignments/097218ee-34eb-fb48-eaf8-ef25d3104cc0" -> null
      - name                 = "097218ee-34eb-fb48-eaf8-ef25d3104cc0" -> null
      - principal_id         = "0f0aa158-b7ad-4cac-af02-82c3e4768ee6" -> null
      - principal_type       = "Group" -> null
      - role_definition_id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/c6a89b2d-59bc-44d0-9896-0f6e12d7b80a" -> null
      - role_definition_name = "Storage Queue Data Message Sender" -> null
      - scope                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01" -> null
    }

  # module.iam.module.admins_roles["0f0aa158-b7ad-4cac-af02-82c3e4768ee6"].module.storage_account.azurerm_role_assignment.queue["iopitnwalletst01|*|writer|Storage Queue Data Message Sender"] will be created
  + resource "azurerm_role_assignment" "queue" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f0aa158-b7ad-4cac-af02-82c3e4768ee6"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Message Sender"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.iam.module.admins_roles["32544b2f-b97d-4453-9555-1ad71630512c"].module.storage_account.azurerm_role_assignment.queue["iopitnwalletst01|*|owner"] will be destroyed
  # (because key ["iopitnwalletst01|*|owner"] is not in for_each map)
  - resource "azurerm_role_assignment" "queue" {
      - id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01/providers/Microsoft.Authorization/roleAssignments/a1745158-b12f-a693-4dc8-f7a407a1ae0c" -> null
      - name                 = "a1745158-b12f-a693-4dc8-f7a407a1ae0c" -> null
      - principal_id         = "32544b2f-b97d-4453-9555-1ad71630512c" -> null
      - principal_type       = "Group" -> null
      - role_definition_id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/974c5e8b-45b9-4653-ba55-5f855dd0fb88" -> null
      - role_definition_name = "Storage Queue Data Contributor" -> null
      - scope                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01" -> null
    }

  # module.iam.module.admins_roles["32544b2f-b97d-4453-9555-1ad71630512c"].module.storage_account.azurerm_role_assignment.queue["iopitnwalletst01|*|owner|Storage Queue Data Contributor"] will be created
  + resource "azurerm_role_assignment" "queue" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "32544b2f-b97d-4453-9555-1ad71630512c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.iam.module.admins_roles["32544b2f-b97d-4453-9555-1ad71630512c"].module.storage_account.azurerm_role_assignment.queue["iopitnwalletst01|*|reader"] will be destroyed
  # (because key ["iopitnwalletst01|*|reader"] is not in for_each map)
  - resource "azurerm_role_assignment" "queue" {
      - id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01/providers/Microsoft.Authorization/roleAssignments/770b0ec1-8279-efa2-8d90-3c072a035e21" -> null
      - name                 = "770b0ec1-8279-efa2-8d90-3c072a035e21" -> null
      - principal_id         = "32544b2f-b97d-4453-9555-1ad71630512c" -> null
      - principal_type       = "Group" -> null
      - role_definition_id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/8a0f0c08-91a1-4084-bc3d-661d67233fed" -> null
      - role_definition_name = "Storage Queue Data Message Processor" -> null
      - scope                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01" -> null
    }

  # module.iam.module.admins_roles["32544b2f-b97d-4453-9555-1ad71630512c"].module.storage_account.azurerm_role_assignment.queue["iopitnwalletst01|*|reader|Storage Queue Data Message Processor"] will be created
  + resource "azurerm_role_assignment" "queue" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "32544b2f-b97d-4453-9555-1ad71630512c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Message Processor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  + resource "azurerm_role_assignment" "queue" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "32544b2f-b97d-4453-9555-1ad71630512c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.iam.module.admins_roles["32544b2f-b97d-4453-9555-1ad71630512c"].module.storage_account.azurerm_role_assignment.queue["iopitnwalletst01|*|writer"] will be destroyed
  # (because key ["iopitnwalletst01|*|writer"] is not in for_each map)
  - resource "azurerm_role_assignment" "queue" {
      - id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01/providers/Microsoft.Authorization/roleAssignments/f0e59230-8042-008c-7ae2-0a1391a371ce" -> null
      - name                 = "f0e59230-8042-008c-7ae2-0a1391a371ce" -> null
      - principal_id         = "32544b2f-b97d-4453-9555-1ad71630512c" -> null
      - principal_type       = "Group" -> null
      - role_definition_id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/c6a89b2d-59bc-44d0-9896-0f6e12d7b80a" -> null
      - role_definition_name = "Storage Queue Data Message Sender" -> null
      - scope                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01" -> null
    }

  # module.iam.module.admins_roles["32544b2f-b97d-4453-9555-1ad71630512c"].module.storage_account.azurerm_role_assignment.queue["iopitnwalletst01|*|writer|Storage Queue Data Message Sender"] will be created
  + resource "azurerm_role_assignment" "queue" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "32544b2f-b97d-4453-9555-1ad71630512c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Queue Data Message Sender"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 10 to add, 7 to change, 6 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
